In [2]:
# apply 함수 사용 
import pandas as pd
df = pd.DataFrame({'a' : [1, 2, 3, 4, 5]})
df

   a
0  1
1  2
2  3
3  4
4  5

In [3]:
def case_function(x):
    if x < 2:
        return '2 미만'
    elif x < 4:
        return '4 미만'
    else:
        return '4 이상'  

df['b'] = df['a'].apply(case_function)
df

   a     b
0  1  2 미만
1  2  4 미만
2  3  4 미만
3  4  4 이상
4  5  4 이상

In [4]:
def function(x): 
    if x == 1:
        return 'one'
    elif x == 2:
        return 'two'
    elif x == 3:
        return 'three'
    elif x == 4:
        return 'four'
    elif x == 5:
        return 'five'
df['c'] = df['a'].apply(function)

In [5]:
df

   a     b      c
0  1  2 미만    one
1  2  4 미만    two
2  3  4 미만  three
3  4  4 이상   four
4  5  4 이상   five

In [8]:
dic = {1 : 'one', 2 : 'two', 3 : 'three', 4 : 'four', 5 : 'five'}

df['d'] = df['a'].map(dic)
df

   a     b      c      d
0  1  2 미만    one    one
1  2  4 미만    two    two
2  3  4 미만  three  three
3  4  4 이상   four   four
4  5  4 이상   five   five

In [10]:
# 데이터 프레임 결합
df1 = pd.DataFrame({'A' : [1, 2, 3], 'B' : [11, 12, 13], 'C' : [21, 22, 23]})
df2 = pd.DataFrame({'A' : [4, 5, 6], 'B' : [14, 15, 16], 'C' : [24, 25, 26]})
df1

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23

In [12]:
# 상하 결합
pd.concat([df1, df2])

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
0  4  14  24
1  5  15  25
2  6  16  26

In [13]:
pd.concat([df2, df1])

   A   B   C
0  4  14  24
1  5  15  25
2  6  16  26
0  1  11  21
1  2  12  22
2  3  13  23

In [14]:
# 서로 다른 필드로 구성되어 있는 데이터 프레임의 결합
df1 = pd.DataFrame({'A' : [1, 2, 3], 'B' : [11, 12, 13], 'C' : [21, 22, 23], 'D' : [31, 32, 33]})
df2 = pd.DataFrame({'A' : [4, 5, 6], 'B' : [14, 15, 16], 'C' : [24, 25, 26], 'E' : [41, 42, 43]})

In [15]:
pd.concat([df1, df2])

   A   B   C     D     E
0  1  11  21  31.0   NaN
1  2  12  22  32.0   NaN
2  3  13  23  33.0   NaN
0  4  14  24   NaN  41.0
1  5  15  25   NaN  42.0
2  6  16  26   NaN  43.0

In [19]:
from numpy import outer


pd.concat([df1, df2], join='outer')

   A   B   C     D     E
0  1  11  21  31.0   NaN
1  2  12  22  32.0   NaN
2  3  13  23  33.0   NaN
0  4  14  24   NaN  41.0
1  5  15  25   NaN  42.0
2  6  16  26   NaN  43.0

In [20]:
pd.concat([df1, df2], join='inner')

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
0  4  14  24
1  5  15  25
2  6  16  26

In [21]:
# 좌우 결합

In [22]:
df1 = pd.DataFrame({'A' : [1, 2, 3], 'B' : [11, 12, 13], 'C' : [21, 22, 23], 'D' : [31, 32, 33]})
df2 = pd.DataFrame({'E' : [4, 5, 6], 'F' : [14, 15, 16], 'G' : [24, 25, 26], 'H' : [41, 42, 43]})

In [23]:
pd.concat([df1, df2], axis = 1)

   A   B   C   D  E   F   G   H
0  1  11  21  31  4  14  24  41
1  2  12  22  32  5  15  25  42
2  3  13  23  33  6  16  26  43

In [24]:
df1 = pd.DataFrame({'id' : [1, 2, 3], '성별' : ['F', 'M', 'F'], '나이' : [20, 30, 40]})
df2 = pd.DataFrame({'id' : [3, 4, 5], '키' : [160.5, 170.3, 180.1], '몸무게' : [45.1, 50.3, 72.1]})

In [27]:
pd.concat([df1, df2], axis=1)

   id 성별  나이  id      키   몸무게
0   1  F  20   3  160.5  45.1
1   2  M  30   4  170.3  50.3
2   3  F  40   5  180.1  72.1

In [28]:
pd.merge(df1, df2, how='left', on='id')

   id 성별  나이      키   몸무게
0   1  F  20    NaN   NaN
1   2  M  30    NaN   NaN
2   3  F  40  160.5  45.1

In [29]:
pd.merge(df2, df1, how='left', on='id')

   id      키   몸무게   성별    나이
0   3  160.5  45.1    F  40.0
1   4  170.3  50.3  NaN   NaN
2   5  180.1  72.1  NaN   NaN

In [30]:
df1 = pd.DataFrame({'user_id' : [1, 2, 3], '성별' : ['F', 'M', 'F'], '나이' : [20, 30, 40]})
df2 = pd.DataFrame({'id' : [3, 4, 5], '키' : [160.5, 170.3, 180.1], '몸무게' : [45.1, 50.3, 72.1]})

In [31]:
pd.merge(df1, df2, how='left', left_on='user_id', right_on='id')

   user_id 성별  나이   id      키   몸무게
0        1  F  20  NaN    NaN   NaN
1        2  M  30  NaN    NaN   NaN
2        3  F  40  3.0  160.5  45.1